Repository: JrgVilela/Jrg.SisMed
Catalog: Jrg.SisMed.Domain/Resources/Messages.*.resx
Languages: pt

# CommonMessage_ArgumentNull
source: The parameter {0} was not provided.
pt: O parametro {0} não foi informado.

# CommonMessage_ArgumentNull_Generic
source: A mandatory clause was not included.
pt: Um parâmetros obrigatório não foi informado.

# CommonMessage_NotFound
source: The expected value was not identified.
pt: Não foi identificado o valor esperado.

# CommonMessage_MaxLengthValidation
source: {0} must have a maximum of {1} characters.
pt: {0} deve ter no máximo {1} caracteres.

# CommonMessage_RequiredValidation
source: {0} is required.
pt: {0} é obrigatório.

# OrganizationMessage_AlreadyExistsByCnpj
source: An organization with CNPJ {0} already exists.
pt: Já existe uma organização com o CNPJ {0}.

# OrganizationMessage_AlreadyExistsByRazaoSocial
source: An organization with the same Razao Social already exists.
pt: Já existe uma organização com a mesma razão social.

# OrganizationMessage_CnpjInvalid
source: The CNPJ provided is invalid.
pt: O CNPJ informado é inválido.

# OrganizationMessage_CnpjRequired
source: The CNPJ is required.
pt: O CNPJ é obrigatório.

# OrganizationMessage_LegalNameMaxLength
source: The legal name must have a maximum of {0} characters.
pt: A razão social deve ter no máximo {0} caracteres.

# OrganizationMessage_LegalNameRequired
source: The legal name is mandatory.
pt: A razão social é obrigatória.

# OrganizationMessage_StateInvalid
source: The reported state is invalid.
pt: O estado informado é inválido.

# OrganizationMessage_TradeNameMaxLength
source: The trade name must have a maximum of {0} characters.
pt: O nome fantasia deve ter no máximo {0} caracteres.

# OrganizationMessage_TradeNameRequired
source: A trade name is required.
pt: O nome fantasia é obrigatório.

# OrganizationMessage_NotFound
source: No organization was found with the value {0}.
pt: Não foi localizado uma organização com o valor {0}.

# CommonMessage_InvalidArgument
source: The value provided as a parameter is not valid.
pt: O valor informado como parametro não é válido.

# UserMessage_AlreadyExistsByEmail
source: A user with this email already exists.
pt: Já existe um usuário cadastrado com este e-mail.

# UserMessage_NameRequired
source: Name is required.
pt: O nome é obrigatório.

# UserMessage_NameMaxLength
source: Name cannot exceed {0} characters.
pt: O nome não pode exceder {0} caracteres.

# UserMessage_EmailRequired
source: Email is required.
pt: O e-mail é obrigatório.

# UserMessage_EmailInvalid
source: Email is invalid.
pt: O e-mail informado é inválido.

# UserMessage_EmailMaxLength
source: Email cannot exceed {0} characters.
pt: O e-mail não pode exceder {0} caracteres.

# UserMessage_PasswordRequired
source: Password is required.
pt: A senha é obrigatória.

# UserMessage_PasswordMinLength
source: Password must be at least {0} characters.
pt: A senha deve ter pelo menos {0} caracteres.

# UserMessage_PasswordMaxLength
source: Password cannot exceed {0} characters.
pt: A senha não pode exceder {0} caracteres.

# UserMessage_ValidationCodeNotFound
source: Validation code not found.
pt: Código de validação não encontrado.

# UserMessage_ValidationCodeExpired
source: The validation code has expired.
pt: O código de validação expirou.

# UserMessage_ValidationCodeAlreadyUsed
source: The validation code has already been used.
pt: O código de validação já foi utilizado.

# UserMessage_ValidationCodeInvalid
source: The validation code is invalid.
pt: O código de validação é inválido.

# UserMessage_UserAlreadyActive
source: The user is already active.
pt: O usuário já está ativo.

# ProfessionalMessage_NameRequired
source: Professional name is required.
pt: O nome do profissional é obrigatório.

# ProfessionalMessage_NameMinLength
source: Name must be at least {0} characters.
pt: O nome deve conter no mínimo {0} caracteres.

# ProfessionalMessage_NameMaxLength
source: Name cannot exceed {0} characters.
pt: O nome deve conter no máximo {0} caracteres.

# ProfessionalMessage_CpfRequired
source: CPF is required.
pt: O CPF é obrigatório.

# ProfessionalMessage_CpfInvalid
source: The CPF provided is invalid.
pt: O CPF informado é inválido.

# ProfessionalMessage_RegisterNumberRequired
source: Professional registration number is required.
pt: O número de registro profissional é obrigatório.

# ProfessionalMessage_RegisterNumberMaxLength
source: Registration number cannot exceed {0} characters.
pt: O número de registro deve conter no máximo {0} caracteres.

# ProfessionalMessage_ProfessionalTypeRequired
source: Professional type is required.
pt: O tipo de profissional é obrigatório.

# ProfessionalMessage_ProfessionalTypeInvalid
source: Professional type is invalid.
pt: O tipo de profissional é inválido.

# ProfessionalMessage_PasswordStrengthRequired
source: Password must contain uppercase letters, lowercase letters, numbers and special characters.
pt: A senha deve conter letras maiúsculas, minúsculas, números e caracteres especiais.

# ProfessionalMessage_PhoneRequired
source: Phone is required.
pt: O telefone é obrigatório.

# ProfessionalMessage_PhoneInvalid
source: Invalid phone number. Expected format: '+55 (11) 98399-1005' (mobile) or '+55 (11) 8399-1005' (landline).
pt: O telefone informado é inválido. Formato esperado: '+55 (11) 98399-1005' (celular) ou '+55 (11) 8399-1005' (fixo).

# ProfessionalMessage_CpfAlreadyExists
source: A professional with this CPF already exists.
pt: Já existe um profissional cadastrado com este CPF.

# ProfessionalMessage_RegisterNumberAlreadyExists
source: A professional with this registration number already exists.
pt: Já existe um profissional cadastrado com este número de registro.

# AddressMessage_StreetRequired
source: Street is required.
pt: A rua é obrigatório.

# AddressMessage_StreetMaxLength
source: Street cannot exceed {0} characters.
pt: A rua não pode exceder {0} caracteres.

# AddressMessage_NumberRequired
source: Address number is required.
pt: É necessário o número do endereço.

# AddressMessage_NumberMaxLength
source: Number cannot exceed {0} characters.
pt: O número não pode exceder {0} caracteres.

# AddressMessage_ComplementMaxLength
source: Complement cannot exceed {0} characters.
pt: O complemento não pode exceder {0} caracteres.

# AddressMessage_NeighborhoodRequired
source: Neighborhood is required.
pt: É necessário ter um bairro.

# AddressMessage_NeighborhoodMaxLength
source: Neighborhood cannot exceed {0} characters.
pt: O bairro não pode exceder {0} caracteres.

# AddressMessage_ZipCodeRequired
source: ZIP code is required.
pt: O CEP é obrigatório.

# AddressMessage_ZipCodeInvalid
source: The ZIP code provided is invalid.
pt: O CEP fornecido é inválido.

# AddressMessage_CityRequired
source: City is required.
pt: É necessário informar a cidade.

# AddressMessage_CityMaxLength
source: City cannot exceed {0} characters.
pt: A cidade não pode exceder {0} caracteres.

# AddressMessage_StateRequired
source: State is required.
pt: O estado é obrigatório.

# AddressMessage_StateLength
source: State must be exactly {0} characters (UF abbreviation).
pt: O estado deve ter exatamente {0} caracteres (abreviação de UF).

# AddressMessage_StateInvalid
source: The state provided is invalid.
pt: O estado fornecido é inválido.

# PhoneMessage_PhoneRequired
source: Phone is required.
pt: O telefone é obrigatório.

# PhoneMessage_PhoneInvalid
source: Invalid phone number. Expected format: '+55 (11) 98399-1005' (mobile) or '+55 (11) 8399-1005' (landline).
pt: O telefone informado é inválido. Formato esperado: '+55 (11) 98399-1005' (celular) ou '+55 (11) 8399-1005' (fixo).

# PhoneMessage_DdiInvalid
source: Country code (DDI) is invalid.
pt: O código do país (DDI) é inválido.

# PhoneMessage_DddInvalid
source: Area code (DDD) is invalid.
pt: O código de área (DDD) é inválido.

# PhoneMessage_NumberInvalid
source: Phone number is invalid.
pt: O número do telefone é inválido.
